system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0) //0
    (1 0 0) //1
    (1 1 0) //2
    (0 1 0) //3
    (0 0 1) //4
    (1 0 1) //5
    (1 1 1) //6
    (0 1 1) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)rotor (60 60 60) simpleGrading (1 1 1)
);

edges
(
   arc 0 1 (0.5 -0.207 0)
   arc 4 5 (0.5 -0.207 1)
   arc 1 2 (1.207 0.5 0)
   arc 5 6 (1.207 0.5 1)
   arc 2 3 (0.5 1.207 0)
   arc 6 7 (0.5 1.207 1)
   arc 3 0 (-0.207 0.5 0)
   arc 7 4 (-0.207 0.5 1)
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    ceiling
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
