constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3600;
        startFace       637200;
    }
    ceiling
    {
        type            patch;
        nFaces          3600;
        startFace       640800;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14400;
        startFace       644400;
    }
)

// ************************************************************************* //
